wind_turbine/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2312                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale   1;

vertices
(
    (-2.51 -2.865 -3) //0
    ( 2.51 -2.865 -3) //1
    ( 2.51  2.15 -3)
    (-2.51  2.15 -3)
    (-2.51 -2.865  5)
    ( 2.51 -2.865  5)
    ( 2.51  2.15  5)
    (-2.51  2.15  5)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (36 50 36) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    walls
    {
        type wall;
        faces
        (
            (7 3 2 6)
            (6 2 1 5)
            (0 4 5 1)
            (0 3 7 4)
        );
    }
    inlet
    {
        type patch;
        faces
        (
            (0 1 2 3)
        );
    }
    outlet
    {
        type patch;
        faces
        (
            (7 6 5 4)
        );
    }
);


// ************************************************************************* //
